INSERT INTO [Предприятия] ([ID предприятия], [Название предприятия],[Расчетный счет], [Телефон], [Контактное лицо])
VALUES
    ('11111111-1111-1111-1111-111111111111',  N'ООО "Рай"', '12345678', '8-800-555-35-35', N'Иван Иванов'),
    ('22222222-2222-2222-2222-222222222222', N'ОАО "Фитовцы"', '12345678', '8-999-123-45-67', N'Вася Пупкин');

INSERT INTO [Типы показателей] ([ID типа], [Название показателя], [Важность])
VALUES
    ('AAAAAAAA-AAAA-AAAA-AAAA-AAAAAAAAAAAA', N'Чистая прибыль', N'Высокая'),
    ('BBBBBBBB-BBBB-BBBB-BBBB-BBBBBBBBBBBB', N'Кол-во клиентов', N'Средняя');

INSERT INTO [Значения показателей] ([ID предприятия], [ID типа показателя],[Значение], [Дата])
VALUES
    ('11111111-1111-1111-1111-111111111111', 'AAAAAAAA-AAAA-AAAA-AAAA-AAAAAAAAAAAA', 1500000.50, '2026-03-03'),
    ('11111111-1111-1111-1111-111111111111', 'BBBBBBBB-BBBB-BBBB-BBBB-BBBBBBBBBBBB', 250, '2026-03-03'),
    ('22222222-2222-2222-2222-222222222222', 'AAAAAAAA-AAAA-AAAA-AAAA-AAAAAAAAAAAA', 9000000.00, '2026-03-03');
GO