
Select ZN.[Значение], T.[Название показателя]
FROM [Значения показателей] ZN
INNER JOIN [Типы показателей] T ON ZN.[ID типа показателя] = T.[ID типа]
WHERE ZN.[Значение] BETWEEN 10 AND 500;


SELECT P.[Название предприятия], 
       T.[Название показателя], 
       V.[Значение],
       CASE 
           WHEN V.[Значение] < 2000 THEN N'НИЗКИЙ'
           WHEN V.[Значение] BETWEEN 2000 AND 4000 THEN N'СРЕДНИЙ'
           WHEN V.[Значение] > 4000 THEN N'ВЫСОКИЙ'
END AS [Уровень показателя]
FROM [Значения показателей] V
INNER JOIN [Предприятия] P ON V.[ID предприятия] = P.[ID предприятия]
INNER JOIN [Типы показателей] T ON V.[ID типа показателя] = T.[ID типа]
WHERE V.[Значение] BETWEEN 0 AND 500
ORDER BY V.[Значение] DESC;


SELECT P.[Название предприятия], 
       ISNULL(CAST(V.[Значение] AS NVARCHAR), N'***') AS [Значение]
FROM [Предприятия] P
    LEFT OUTER JOIN [Значения показателей] V ON P.[ID предприятия] = V.[ID предприятия];


SELECT P.[Название предприятия], V.[Значение]
FROM [Предприятия] P
    FULL OUTER JOIN [Значения показателей] V ON P.[ID предприятия] = V.[ID предприятия];


SELECT P.[Название предприятия], V.[Значение]
FROM [Значения показателей] V
    FULL OUTER JOIN [Предприятия] P ON V.[ID предприятия] = P.[ID предприятия];


SELECT V.[Значение], T.[Название показателя]
FROM [Значения показателей] V
    CROSS JOIN [Типы показателей] T
WHERE V.[ID типа показателя] = T.[ID типа];