SELECT PR.[Название предприятия]
FROM [Предприятия] PR
WHERE PR.[ID предприятия] IN (
    SELECT ZN.[ID предприятия]
    FROM [Значения показателей] ZN
    WHERE [Значение] > 10000
    );

SELECT PR.[Название предприятия]
FROM [Предприятия] PR
    INNER JOIN (
    SELECT DISTINCT [ID предприятия]
    FROM [Значения показателей]
    WHERE [Значение] > 100
    ) AS FILT ON PR.[ID предприятия] = FILT.[ID предприятия];

SELECT P.[Название предприятия], T.[Название показателя], V.[Значение]
FROM [Значения показателей] V
    INNER JOIN [Предприятия] P ON V.[ID предприятия] = P.[ID предприятия]
    INNER JOIN [Типы показателей] T ON V.[ID типа показателя] = T.[ID типа]
WHERE T.[Важность] = N'Высокая';

SELECT V1.[ID предприятия], V1.[Значение], V1.[Дата]
FROM [Значения показателей] V1
WHERE V1.[Дата] = (
    SELECT TOP 1 V2.[Дата]
    FROM [Значения показателей] V2
    WHERE V2.[ID предприятия] = V1.[ID предприятия]
    ORDER BY V2.[Дата] DESC
    )
ORDER BY V1.[ID предприятия];

SELECT P.[Название предприятия]
FROM [Предприятия] P
WHERE NOT EXISTS (
    SELECT *
    FROM [Значения показателей] V
    WHERE V.[ID предприятия] = P.[ID предприятия]
    );

SELECT
    (SELECT AVG([Значение]) FROM [Значения показателей] V
    INNER JOIN [Типы показателей] T ON V.[ID типа показателя] = T.[ID типа]
WHERE T.[Название показателя] = N'Прибыль') AS [Средняя прибыль],
    (SELECT AVG([Значение]) FROM [Значения показателей] V
    INNER JOIN [Типы показателей] T ON V.[ID типа показателя] = T.[ID типа]
WHERE T.[Название показателя] = N'Затраты') AS [Средние затраты];

SELECT [Значение], [Дата]
FROM [Значения показателей]
WHERE [Значение] > ALL (
    SELECT V.[Значение]
    FROM [Значения показателей] V
    INNER JOIN [Типы показателей] T ON V.[ID типа показателя] = T.[ID типа]
    WHERE T.[Важность] = N'Низкая'
    );

SELECT [Значение], [Дата]
FROM [Значения показателей]
WHERE [Значение] > ANY (
    SELECT V.[Значение]
    FROM [Значения показателей] V
    INNER JOIN [Типы показателей] T ON V.[ID типа показателя] = T.[ID типа]
    WHERE T.[Важность] = N'Высокая'
    );