SELECT t.[Название показателя],
       MAX(v.[Значение]) AS [Макс. значение],
       MIN(v.[Значение]) AS [Мин. значение],
       AVG(v.[Значение]) AS [Среднее значение],
       SUM(v.[Значение]) AS [Сумма значений],
       COUNT(v.[ID значения]) AS [Количество записей]
FROM [Типы показателей] t
    INNER JOIN [Значения показателей] v ON t.[ID типа] = v.[ID типа показателя]
GROUP BY t.[Название показателя];

SELECT
    CASE
        WHEN [Значение] < 1000 THEN N'Низкие'
        WHEN [Значение] BETWEEN 1000 AND 10000 THEN N'Средние'
        ELSE N'Высокие'
END AS [Диапазон значений],
    COUNT(*) AS [Количество записей]
FROM [Значения показателей]
GROUP BY 
    CASE 
        WHEN [Значение] < 1000 THEN N'Низкие'
        WHEN [Значение] BETWEEN 1000 AND 10000 THEN N'Средние'
        ELSE N'Высокие'
END
ORDER BY [Количество записей] DESC;

SELECT T.[Уровень важности], COUNT(*) AS [Количество]
FROM (
    SELECT
    CASE
    WHEN [Важность] IN (N'Критическая', N'Высокая') THEN N'Приоритетные'
    ELSE N'Обычные'
    END AS [Уровень важности]
    FROM [Типы показателей]
    ) AS T
GROUP BY T.[Уровень важности]
ORDER BY T.[Уровень важности] DESC;

SELECT p.[Название предприятия], t.[Важность],
       ROUND(CAST(AVG(v.[Значение]) AS FLOAT), 2) AS [Среднее значение]
FROM [Предприятия] p
    INNER JOIN [Значения показателей] v ON p.[ID предприятия] = v.[ID предприятия]
    INNER JOIN [Типы показателей] t ON v.[ID типа показателя] = t.[ID типа]
GROUP BY p.[Название предприятия], t.[Важность]
ORDER BY [Среднее значение] DESC;

SELECT p.[Название предприятия], t.[Важность],
       ROUND(CAST(AVG(v.[Значение]) AS FLOAT), 2) AS [Среднее значение]
FROM [Предприятия] p
    INNER JOIN [Значения показателей] v ON p.[ID предприятия] = v.[ID предприятия]
    INNER JOIN [Типы показателей] t ON v.[ID типа показателя] = t.[ID типа]
WHERE t.[Важность] = N'Высокая'
GROUP BY p.[Название предприятия], t.[Важность]
ORDER BY [Среднее значение] DESC;

SELECT p.[Название предприятия], t.[Название показателя],
       ROUND(CAST(AVG(v.[Значение]) AS FLOAT), 2) AS [Среднее значение]
FROM [Предприятия] p
    INNER JOIN [Значения показателей] v ON p.[ID предприятия] = v.[ID предприятия]
    INNER JOIN [Типы показателей] t ON v.[ID типа показателя] = t.[ID типа]
WHERE p.[Название предприятия] = N'ЗАО "Волос Шимана"'
GROUP BY p.[Название предприятия], t.[Название показателя];

SELECT p.[Название предприятия], COUNT(v.[ID значения]) AS [Количество показателей]
FROM [Предприятия] p
    INNER JOIN [Значения показателей] v ON p.[ID предприятия] = v.[ID предприятия]
GROUP BY p.[Название предприятия]
HAVING COUNT(v.[ID значения]) > 2
ORDER BY [Количество показателей] DESC;